# PA 004

In [60]:
from IPython.core.display  import HTML

import pandas as pd

In [26]:
def jupyter_settings():
    #%matplotlib inline
    #%pylab inline
    
    #plt.style.use('bmh')
    #plt.rcParams['figure.figsize'] = [20, 12]
    #plt.rcParams['font.size'] = 25
    
    display(HTML( '<style>.container {width:100% !important;}</style>'))
   #pd.options.display.max_columns = None
   #pd.options.display.max_rows = None
   #pd.set_option('display.expand_frame_repr', False)
            
   #sns.set()

In [19]:
jupyter_settings ()

# Credentials

In [27]:
# Credentials
host = 'comunidade-ds-postgres.c50pcakiuwi3.us-east-1.rds.amazonaws.com'
port = 5432
database = 'comunidadedsdb'
username = 'member'
pwd = 'cdspa'

# psycopg2

In [ ]:
import psycopg2 as pg

In [63]:
conn = pg.connect ( user = username,
                    password = pwd,
                    host = host,
                    port = port,
                    database = database)

## 1.0. Schema Query

In [45]:
cursor = conn.cursor()

query_schema = """
        SELECT nspname
        FROM pg_catalog.pg_namespace
"""

cursor.execute (query_schema)

record = cursor.fetchall()
print( record )

cursor.close()
conn.close()

[('pg_toast',), ('pg_temp_1',), ('pg_toast_temp_1',), ('pg_catalog',), ('information_schema',), ('public',), ('pa004',), ('pg_temp_4',), ('pg_toast_temp_4',), ('pa005',), ('pg_temp_9',), ('pg_toast_temp_9',)]

## 2.0. Table Query

In [52]:
cursor = conn.cursor()

query_tables = """
        SELECT tablename
        FROM pg_tables
        WHERE schemaname = 'pa004'
"""

cursor.execute(query_tables)

record = cursor.fetchall()
print( record )

cursor.close()
conn.close()

[('users',), ('vehicle',), ('insurance',)]

## 3.0. Collect data using Psycopg2

In [58]:
cursor = conn.cursor()

query_tables_users = """
        SELECT *
        FROM pa004.users u
        WHERE u.age > 44
        LIMIT 10
"""

cursor.execute(query_tables_users)

record = cursor.fetchall()
print( record )

cursor.close()
conn.close()

[(2, 'Male', 76, 3.0, 26.0), (3, 'Male', 47, 28.0, 26.0), (8, 'Female', 56, 28.0, 26.0), (11, 'Female', 47, 35.0, 124.0), (14, 'Male', 76, 28.0, 13.0), (15, 'Male', 71, 28.0, 30.0), (20, 'Female', 60, 33.0, 124.0), (21, 'Male', 65, 28.0, 124.0), (22, 'Male', 49, 28.0, 124.0), (27, 'Female', 51, 28.0, 124.0)]

In [62]:
data = pd.DataFrame (record)
data.head()

    0       1   2     3      4
0   2    Male  76   3.0   26.0
1   3    Male  47  28.0   26.0
2   8  Female  56  28.0   26.0
3  11  Female  47  35.0  124.0
4  14    Male  76  28.0   13.0

## 4.0. Collect data using Pandas

In [65]:
import pandas.io.sql as psql

In [66]:
query_tables_users = """
        SELECT *
        FROM pa004.users u
        WHERE u.age > 44
        LIMIT 10
"""

df = psql.read_sql (query_tables_users, conn)
df.head()

C:\Users\dml1wfe\repos\envs\pa004_health_insurance\pa004_health_insurance\lib\site-packages\pandas\io\sql.py:758: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id  gender  age  region_code  policy_sales_channel
0   2    Male   76          3.0                  26.0
1   3    Male   47         28.0                  26.0
2   8  Female   56         28.0                  26.0
3  11  Female   47         35.0                 124.0
4  14    Male   76         28.0                  13.0

In [67]:
df1 = pd.read_sql (query_tables_users, conn)
df1.head()

C:\Users\dml1wfe\repos\envs\pa004_health_insurance\pa004_health_insurance\lib\site-packages\pandas\io\sql.py:758: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id  gender  age  region_code  policy_sales_channel
0   2    Male   76          3.0                  26.0
1   3    Male   47         28.0                  26.0
2   8  Female   56         28.0                  26.0
3  11  Female   47         35.0                 124.0
4  14    Male   76         28.0                  13.0

In [68]:
cursor.close()
conn.close()